
const initialState = {
    golova: {
        info: ["Освіта: неповна-вища, Тернопільського національного педагогічного університету імені Володимира Гнатюка.",
            "Спеціальність: Професійна освіта. Цифрові технології",
            "Стаж роботи: 4 роки",
            "Посада: Вчитель інформатики",
            "Категорія: Спеціаліст ІІ категорії",
        ],
        meta: [
            " Створювати сприятливі умови для розвитку і самореалізації особистості",
            " Розвиток алгоритмічного мислення та інформаційної культури в цифровому світі",
            "Розвиток творчих здібностей та самостійно здобувати знання впродовж життя"
        ],
        kompetention: [
            "Професійна компетентність вчителя",
            "Професійна компетентність наукового керівника відділення Інформаційних технологій",
            "Системного адміністратора ( налагодження пристроїв, веб-взаємодія)",
            "Цифрова грамотність, кібергігієна поглибленого рівня",
            "Розробник ПЗ (Full Stack, Android, IoS)",
            "Soft Skills",
        ],
        interes: ["Верстка веб сторінок:", "FrontEnd:", "BeckEnd:", "Android:", "Алгоритмування та ООП:",],
    },
    doc: [
        {
            id: 1, title: "Санітарні вимоги до кабінету інформатики 2024", text: "Вимоги до комп’ютерного обладнання, яким комплектуються навчальні приміщення, призначені для роботи з персональними комп’ютерами визначені у Типовому переліку комп’ютерного обладнання для закладів дошкільної, загальної середньої та професійної (професійно-технічної) освіти, затвердженому наказом Міністерства освіти і науки України від 02 листопада 2017 року N 1440, зареєстрованому в Міністерстві юстиції України 15 січня 2018 року за N 55/31507.",
            link: "https://docs.google.com/document/d/16Okn-NBL2Kv2BHgpwKKKBxG3YtFqfQpfkeQmN4h7fbg/edit?usp=sharing"
        },
        {
            id: 2, title: "Методичні рекомендації щодо викладання інформатики у 2022/2023 н.р.", text: "ІНСТРУКТИВНО-МЕТОДИЧНІ РЕКОМЕНДАЦІЇ             щодо організації освітнього процесу та викладання             навчальних предметів у закладах загальної середньої освіти у 2022/2023 навчальному році",
            link: "https://docs.google.com/document/d/1zX9dyhhxDER8rReB6bVMKvMQfBu5SX47tsJCm3i2IrE/edit?usp=sharing"
        },
        {
            id: 3, title: "НУШ 5-6 клас. Інформатична галузь. Методичні рекомендації 2022-2023", text: "Нова українська школа у базовій середній освіті: впевнені кроки ",
            link: "https://docs.google.com/document/d/1uIp5yvm_50G2CVq7ReuuD_A-CUw_1FRYxusf2X4B_Ps/edit?usp=sharing"
        },
        //{
        //    id: 4, title: "", text: "",
        //    link: ""
        //},
        //{
        //    id: 5, title: "", text: "",
        //    link: ""
        //},
        //{
        //    id: 6, title: "", text: "",
        //    link: ""
        //},
    ],
    new: [
        { title: "", img: "", title_text: "", text: "" },
        { title: "", img: "", title_text: "", text: "" },
        { title: "", img: "", title_text: "", text: "" },
        { title: "", img: "", title_text: "", text: "" },
        { title: "", img: "", title_text: "", text: "" },
    ],
    modal: [
        { title: "Верстка", img: "", text: "", link: "" },
        { title: "FrontEnd", img: "", text: "", link: "" },
        { title: "BeckEnd", img: "", text: "", link: "" },
        { title: "Бази даних", img: "", text: "", link: "" },
        { title: "Робототехніка", img: "", text: "", link: "" },
        { title: "Алгоритмування", img: "", text: "", link: "" },
    ],
    publick: [
        {
            info: "Олімпіади та конурси 2023-2024",
            olimp: {
                title: 'Олімпіади:',
                text: [
                    ["Інформаційні технології: 10 учасників – 8 призових місць.  ",
                        "Інформатика: 8 учасників – 4 призові місця. "],
                    ["Інформаційні технології: 5 учасників – 3 призові місця.",
                        " Інформатика: 4 учасники – 3 призові місця. "],
                    ["Інформаційні технології: 3 учасники – 2 призові місця. ",
                        "Інформатика: 3 учасники – 1 призове місце. "],
                ]
            },
            man: {
                title: 'Виступи МАН:',
                text: [
                    "Розробка сайту для створення тестів. Леміщак С.",
                    "Розробка голосового помічника на основі нейромереж. Федик М."
                ]
            }
        }
    ]
}

const pagesReduser = (state = initialState, action) => {
    switch (action.type) {
        case ' ':
            break
        default:
            return state;
    }
}
export {
    pagesReduser
}