
const initialState = {
    golova: {
        info: ["Освіта: неповна-вища, Тернопільського національного педагогічного університету імені Володимира Гнатюка.",
            "Спеціальність: Професійна освіта. Цифрові технології",
            "Стаж роботи: 4 роки",
            "Посада: Вчитель інформатики",
            "Категорія: Спеціаліст ІІ категорії",
        ],
        meta: [
            " Створювати сприятливі умови для розвитку і самореалізації особистості",
            " Розвиток алгоритмічного мислення та інформаційної культури в цифровому світі",
            "Розвиток творчих здібностей та самостійно здобувати знання впродовж життя"
        ],
        kompetention: [
            "Професійна компетентність вчителя",
            "Професійна компетентність наукового керівника відділення Інформаційних технологій",
            "Системного адміністратора ( налагодження пристроїв, веб-взаємодія)",
            "Цифрова грамотність, кібергігієна поглибленого рівня",
            "Розробник ПЗ (Full Stack, Android, IoS)",
            "Soft Skills",
        ],
        interes: ["Верстка веб сторінок:", "FrontEnd:", "BeckEnd:", "Android:", "Алгоритмування та ООП:",],
    },
    doc: [
        { id: 1, title: "", text: "", link: "" },
        { id: 2, title: "", text: "", link: "" },
        { id: 3, title: "", text: "", link: "" },
        { id: 4, title: "", text: "", link: "" },
        { id: 5, title: "", text: "", link: "" },
        { id: 6, title: "", text: "", link: "" },
    ]
}

const pagesReduser = (state = initialState, action) => {
    switch (action.type) {
        case ' ':
            break
        default:
            return state;
    }
}
export {
    pagesReduser
}