import modalImg1 from './../img/modal/1.png';
import modalImg2 from './../img/modal/2.jpg';
import modalImg3 from './../img/modal/3.png';
import modalImg4 from './../img/modal/4.webp';
import modalImg5 from './../img/modal/5.jpg';
import modalImg6 from './../img/modal/6.png';
const initialState = {
    golova: {
        info: ["Освіта: неповна-вища, Тернопільського національного педагогічного університету імені Володимира Гнатюка.",
            "Спеціальність: Професійна освіта. Цифрові технології",
            "Стаж роботи: 4 роки",
            "Посада: Вчитель інформатики",
            "Категорія: Спеціаліст ІІ категорії",
        ],
        meta: [
            " Створювати сприятливі умови для розвитку і самореалізації особистості",
            " Розвиток алгоритмічного мислення та інформаційної культури в цифровому світі",
            "Розвиток творчих здібностей та самостійно здобувати знання впродовж життя"
        ],
        kompetention: [
            "Професійна компетентність вчителя",
            "Професійна компетентність наукового керівника відділення Інформаційних технологій",
            "Системного адміністратора ( налагодження пристроїв, веб-взаємодія)",
            "Цифрова грамотність, кібергігієна поглибленого рівня",
            "Розробник ПЗ (Full Stack, Android, IoS)",
            "Soft Skills",
        ],
        interes: ["Верстка веб сторінок:", "FrontEnd:", "BeckEnd:", "Android:", "Алгоритмування та ООП:",],
    },
    doc: [
        {
            id: 1, title: "Санітарні вимоги до кабінету інформатики 2024", text: "Вимоги до комп’ютерного обладнання, яким комплектуються навчальні приміщення, призначені для роботи з персональними комп’ютерами визначені у Типовому переліку комп’ютерного обладнання для закладів дошкільної, загальної середньої та професійної (професійно-технічної) освіти, затвердженому наказом Міністерства освіти і науки України від 02 листопада 2017 року N 1440, зареєстрованому в Міністерстві юстиції України 15 січня 2018 року за N 55/31507.",
            link: "https://docs.google.com/document/d/16Okn-NBL2Kv2BHgpwKKKBxG3YtFqfQpfkeQmN4h7fbg/edit?usp=sharing"
        },
        {
            id: 2, title: "Методичні рекомендації щодо викладання інформатики у 2022/2023 н.р.", text: "ІНСТРУКТИВНО-МЕТОДИЧНІ РЕКОМЕНДАЦІЇ             щодо організації освітнього процесу та викладання             навчальних предметів у закладах загальної середньої освіти у 2022/2023 навчальному році",
            link: "https://docs.google.com/document/d/1zX9dyhhxDER8rReB6bVMKvMQfBu5SX47tsJCm3i2IrE/edit?usp=sharing"
        },
        {
            id: 3, title: "НУШ 5-6 клас. Інформатична галузь. Методичні рекомендації 2022-2023", text: "Нова українська школа у базовій середній освіті: впевнені кроки ",
            link: "https://docs.google.com/document/d/1uIp5yvm_50G2CVq7ReuuD_A-CUw_1FRYxusf2X4B_Ps/edit?usp=sharing"
        },
        //{
        //    id: 4, title: "", text: "",
        //    link: ""
        //},
        //{
        //    id: 5, title: "", text: "",
        //    link: ""
        //},
        //{
        //    id: 6, title: "", text: "",
        //    link: ""
        //},
    ],
    new: [
        { title: "", img: "", title_text: "", text: "" },
        { title: "", img: "", title_text: "", text: "" },
        { title: "", img: "", title_text: "", text: "" },
        { title: "", img: "", title_text: "", text: "" },
        { title: "", img: "", title_text: "", text: "" },
    ],
    modal: [
        {
            title: "Верстка",
            img: modalImg1,
            text: "Вивчення верстки веб-сайтів може надати дітям безліч корисних переваг: від розвитку креативності та навичок дизайну до підвищення комп'ютерної грамотності та проблемного мислення. Це також сприяє комунікації та співпраці, надає можливість використання нових технологій та інструментів, а також сприяє самовираженню та підвищенню впевненості у собі дітей, дозволяючи їм відчути себе частиною широкого світу Інтернету.", link: "/"
        },
        {
            title: "FrontEnd",
            img: modalImg2,
            text: "Вивчення фронтенд-розробки на базі React може значно розширити можливості старшокласників. Вони зможуть поглибити свої знання HTML, CSS та JavaScript, вивчаючи відомий фреймворк для створення інтерактивних веб-додатків. Робота з React дозволить їм розробляти складні та ефективні веб-застосунки з використанням компонентного підходу, що сприяє організації коду та полегшує його розширення. Вивчення React також сприятиме розвитку навичок роботи в команді через можливість спільної роботи над великими проектами та використання популярних інструментів розробки, таких як Git та GitHub. Крім того, це надасть старшокласникам підґрунтя для подальшої кар'єри в сфері програмування та розробки веб-додатків.", link: "/"
        },
        {
            title: "BeckEnd",
            img: modalImg3,
            text: "Вивчення backend-розробки може відкрити перед старшокласниками цілий світ можливостей у сфері програмування та інформаційних технологій. Вони зможуть поглибити свої знання у мовах програмування, таких як Python, Java або JavaScript, і здійснювати розробку серверної частини веб-додатків. Розуміння архітектури та принципів роботи серверів, баз даних і API дозволить їм створювати потужні, масштабовані та безпечні веб-застосунки. Робота з backend також сприятиме розвитку навичок управління даними, використання сучасних технологій розробки (наприклад, фреймворків, бібліотек та інструментів), а також забезпечить основу для подальшого вивчення спеціалізованих областей, таких як машинне навчання або інтернет речей. Крім того, навички backend-розробки дають старшокласникам можливість здійснювати вплив на світ через створення ефективних та функціональних веб-додатків, що можуть вирішувати реальні проблеми та полегшувати життя людям.", link: "/"
        },
        {
            title: "Бази даних",
            img: modalImg4,
            text: "Навички роботи з MongoDB, яка є NoSQL базою даних, дозволять дітям оволодіти гнучкими та швидкими методами зберігання даних, ідеально підходять для сучасних веб-додатків, що потребують гнучкої структури даних. З іншого боку, вивчення SQL відкриває двері до реляційних баз даних, таких як MySQL або PostgreSQL, де старшокласники навчаться створювати та управляти базами даних за допомогою мови запитів SQL, що є стандартом у світі баз даних. Вивчення цих двох підходів допоможе старшокласникам розвинути навички роботи з даними, розуміння їх структури та взаємозв'язків, що важливо для будь-якої сфери розвитку програмного забезпечення, від веб-розробки до аналітики даних.", link: "/"
        },
        {
            title: "Робототехніка",
            img: modalImg5,
            text: "За допомогою Arduino Uno діти можуть експериментувати з різними сенсорами, актуаторами та модулями, що розширює їхні знання про фізику, електроніку та механіку. Вивчення цієї технології також сприяє розвитку технічних навичок та підготовці до майбутньої кар'єри у сферах інженерії, розробки програмного забезпечення та інноваційних технологій. Крім того, робота з Arduino Uno може стимулювати творчість, заохочуючи дітей до власних проектів та ідей, які можуть мати великий вплив на їхнє оточення та суспільство в цілому.", link: "/"
        },
        {
            title: "Алгоритмування",
            img: modalImg6,
            text: "Вивчення алгоритмів надає дітям набір цінних навичок, які вони можуть використовувати у всіх аспектах життя. Воно сприяє розвитку логічного мислення, креативності та аналітичних здібностей, допомагаючи дітям розв'язувати складні завдання та ефективно працювати з великими обсягами інформації. Вивчення алгоритмів також навчає систематичному підходу до розв'язання проблем та розробки оптимальних стратегій, що є важливим для успішного виконання завдань у навчанні, кар'єрі та житті загалом.", link: "/"
        },
    ],
    publick: [
        {
            info: "Олімпіади та конурси 2023-2024",
            olimp: {
                title: 'Олімпіади:',
                text: [
                    ["Інформаційні технології: 10 учасників – 8 призових місць.  ",
                        "Інформатика: 8 учасників – 4 призові місця. "],
                    ["Інформаційні технології: 5 учасників – 3 призові місця.",
                        " Інформатика: 4 учасники – 3 призові місця. "],
                    ["Інформаційні технології: 3 учасники – 2 призові місця. ",
                        "Інформатика: 3 учасники – 1 призове місце. "],
                ]
            },
            man: {
                title: 'Виступи МАН:',
                text: [
                    "Розробка сайту для створення тестів. Леміщак С.",
                    "Розробка голосового помічника на основі нейромереж. Федик М."
                ]
            }
        }
    ]
}

const pagesReduser = (state = initialState, action) => {
    switch (action.type) {
        case ' ':
            break
        default:
            return state;
    }
}
export {
    pagesReduser
}